v2206/Projects/DPM_lid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0    0.0    0.0)  // 0
    (1.0    0.0    0.0)  // 1
    (1.0    1.0    0.0)  // 2
    (0.0    1.0    0.0)  // 3

    (0.0    0.0    0.08)  // 4
    (1.0    0.0    0.08)  // 5
    (1.0    1.0    0.08)  // 6
    (0.0    1.0    0.08)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (2 1 5 6)
            (3 7 4 0)
            (4 5 1 0)
        );
    }

    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
);

// ************************************************************************* //
