v2206/Projects/DPM_lid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    // div(alphaPhi.water,U.water)    Gauss linear;
    div(alphaPhi.water,U.water)    Gauss linearUpwindV unlimited;
    div(((alpha.water*nuEff.water)*dev2(T(grad(U.water))))) Gauss linear;
}

laplacianSchemes
{
    // default         Gauss linear orthogonal;
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    // default         orthogonal;
    default         corrected;
}


// ************************************************************************* //
